Ran Plan for project: `fileflow-prod` dir: `terraform/fileflow` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_appautoscaling_policy.ecs-cpu will be created
+ resource "aws_appautoscaling_policy" "ecs-cpu" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "fileflow-cpu-autoscaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/fileflow-cluster/fileflow-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 70

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # aws_appautoscaling_policy.ecs-memory will be created
+ resource "aws_appautoscaling_policy" "ecs-memory" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "fileflow-memory-autoscaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/fileflow-cluster/fileflow-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # aws_appautoscaling_target.ecs will be created
+ resource "aws_appautoscaling_target" "ecs" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 2
      + resource_id        = "service/fileflow-cluster/fileflow-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "ManagedBy" = "Terraform"
          + "Module"    = "fileflow"
        }
    }

  # aws_cloudwatch_log_group.fileflow is tainted, so must be replaced
-/+ resource "aws_cloudwatch_log_group" "fileflow" {
      ~ arn               = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/ecs/fileflow" -> (known after apply)
      ~ id                = "/aws/ecs/fileflow" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
        name              = "/aws/ecs/fileflow"
      + name_prefix       = (known after apply)
        tags              = {
            "Component"   = "cloudwatch-logs"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "Name"        = "fileflow-logs"
            "Owner"       = "platform-team@ryuqqq.com"
            "Service"     = "fileflow"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_ecs_service.fileflow will be created
+ resource "aws_ecs_service" "fileflow" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:ap-northeast-2:646886795421:cluster/fileflow-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "fileflow-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Component"   = "ecs-service"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-service"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all                           = {
          + "Component"   = "ecs-service"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-service"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "fileflow"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/fileflow-tg/1c986d8303b8c294"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-00ea30a5634d9fed3",
            ]
          + subnets          = [
              + "subnet-09692620519f86cf0",
              + "subnet-0d99080cbe134b6e9",
            ]
        }
    }

  # aws_ecs_task_definition.fileflow will be created
+ resource "aws_ecs_task_definition" "fileflow" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::646886795421:role/fileflow-ecs-task-execution-role"
      + family                   = "fileflow"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Component"   = "ecs-task-definition"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-task-definition"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all                 = {
          + "Component"   = "ecs-task-definition"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-task-definition"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + task_role_arn            = "arn:aws:iam::646886795421:role/fileflow-ecs-task-role"
      + track_latest             = false
    }

  # aws_iam_role_policy.ecs-task-execution-secrets will be created
+ resource "aws_iam_role_policy" "ecs-task-execution-secrets" {
      + id          = (known after apply)
      + name        = "fileflow-secrets-access"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "fileflow-ecs-task-execution-role"
    }

  # aws_lb.fileflow will be created
+ resource "aws_lb" "fileflow" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "fileflow-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-019ff11a3b86e8693",
        ]
      + subnets                                                      = [
          + "subnet-0bd2fc282b0fb137a",
          + "subnet-0c8c0ad85064b80bb",
        ]
      + tags                                                         = {
          + "Component"   = "application-load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-alb"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all                                                     = {
          + "Component"   = "application-load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-alb"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.http will be created
+ resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Component"   = "alb-listener"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-http-listener"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all                                                              = {
          + "Component"   = "alb-listener"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-http-listener"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/fileflow-tg/1c986d8303b8c294"
          + type             = "forward"
        }
    }

  # aws_secretsmanager_secret.fileflow-db will be created
+ resource "aws_secretsmanager_secret" "fileflow-db" {
      + arn                            = (known after apply)
      + description                    = "FileFlow database credentials and connection information"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = "arn:aws:kms:ap-northeast-2:646886795421:key/c864126f-d148-41ef-80eb-ed41a8edb2c4"
      + name                           = "fileflow/database/credentials"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "Component"   = "secrets-manager"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-db-credentials"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all                       = {
          + "Component"   = "secrets-manager"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-db-credentials"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
    }

  # aws_secretsmanager_secret_version.fileflow-db will be created
+ resource "aws_secretsmanager_secret_version" "fileflow-db" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 11 to add, 0 to change, 1 to destroy.

Changes to Outputs:
+ alb_arn                     = (known after apply)
+ alb_dns_name                = (known after apply)
+ alb_zone_id                 = (known after apply)
+ database_secret_arn         = (known after apply)
+ ecs_service_id              = (known after apply)
+ health_check_url            = (known after apply)
+ log_group_arn               = (known after apply)
+ service_url                 = (known after apply)
+ task_definition_arn         = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p fileflow-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FInfrastructure%252Fterraform%252Ffileflow%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p fileflow-prod
  ```
Plan: 11 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```